import user from '../user';
import chat from '../chat';

import ui from '../modules/ui';
import methods from "../modules/methods";

let edu = {};

let camera = null;
let isShort = false;
let isLong = false;

let step = 0;

let backPos = new mp.Vector3(0,0,0);

let shortPos = [
    [
        "Уникальные фишки",
        "info",
        "Сейчас мы покажем вам уникальные системы нашего проекта",
        -2514.938720703125, -204.4708709716797, 20.279455184936523, //PosCam
        -2481.946044921875, -221.96531677246094, 20.23413848876953, //PosAt
    ],
    [
        "Недвижимость",
        "info",
        "Как вы можете заметить на карте отображены дома с гаражом. Количество гаражей в одном доме варьируется от 1 до 3. Нет никакого ограничения на кол-во машин в одном гараже, ограничением является только свободное место внутри самого гаража, т.е условно вы можете поставить 2 машины просторно или же 5 машин впритык друг к другу.",
        -1579.270751953125, 22.182931900024414, 91.5652084350586, //PosCam
        -1532.903564453125, 113.92567443847656, 68.64871978759766, //PosAt
    ],
    [
        "Бизнес",
        "info",
        "Огромное разнообразия бизнесов не заставит вас заскучать, начиная от аренды мопедов заканчивая целым банком. При покупке бизнеса у вас появляется офис в здании Аркадиуса где вы сможете сами выбрать интерьер, кастомизировать его различным образом, выставить цены на услуги вашего бизнеса и многое, многое другое.",
        -68.30360412597656, -617.302978515625, 39.792640686035156, //PosCam
        -118.74618530273438, -602.749755859375, 63.64939880371094, //PosAt
    ],
    [
        "Склады",
        "info",
        "Система кастомизации складов, вы сами выбираете какие ящики будут располагаться на вашем складе, т.е если вам не хватает места вы всегда можете докупить еще один ящик на склад, вы так же сможете загонять свое личное авто на склад, для более удобной разгрузки или использовать склад, как гараж. Но и это еще не все, есть 3 вида склада, которые различаются своим масштабом.",
        1000.41943359375, -2507.96533203125, 32.75449752807617, //PosCam
        1010.35400390625, -2521.211181640625, 28.78205680847168, //PosAt
    ],
    [
        "Транспорт",
        "info",
        "Огромное количество тюнинга которые вы сможете установить на свое авто, так же вы сможете установить модуль удаленного доступа к вашему автомобилю, с ним вы сможете находясь на другом конце города заводить свое авто, открывать/закрывать двери, включать/выключать неон, если конечно мобильная сеть это позволит об этом чутка позже.",
        -811.811279296875, -261.92950439453125, 41.11868667602539, //PosCam
        -797.8977661132812, -229.74856567382812, 36.07963943481445, //PosAt
    ],
    [
        "Оружие",
        "info",
        "На сервере присутствует большой выбор оружия, но это еще не все, буквально на каждое оружие вы сможете купить и надеть модификации, начиная от прицела заканчивая глушителем.",
        813.353271484375, -2150.09326171875, 31.295949935913086, //PosCam
        810.5155029296875, -2156.050537109375, 30.294580459594727, //PosAt
    ],
    [
        "Система фракций",
        "info",
        "Начнем с главного, у нас больше нет линейной системы рангов, у каждой организации есть свои отделы, а в отделах своя линия рангов. У каждой гос. организации есть свой бюджет которым лидер сможет распоряжаться. С помощью этого бюджета лидер может докупать транспорт в департамент, делать прибавку к зарплате работников, в общем организация, это своя небольшая экономика. Так же появилась настройка позволяющая разрешать пользование транспорта определенному отделу, рангу. Все переводы людей из одного отдела в другой так же доступны функционально.",
        -112.46650695800781, -954.26806640625, 70.30892181396484, //PosCam
        -57.42127227783203, -896.4922485351562, 82.65200805664062, //PosAt
    ],
    [
        "Криминал и криптовалюта",
        "info",
        "Вы сами выбираете какая будет у вас организация, будь то это мафия или же уличная банда - не важно, у нас нет никаких функциональных ограничений на это. Каждую ночь на сервере будет проходить война за грузы в которой сможет принять участия любая преступная организация. Содержимое фургонов очень разнообразное. Так же вас ожидает ограбление банков, магазинов, захват улиц для получения дохода и много всего интересного. На сервер введена криптовалюта BitCoin которая является неотъемлемой частью всего криминала.",
        101.28582763671875, -2009.500732421875, 40.17243194580078, //PosCam
        104.15574645996094, -1907.693359375, 40.16686248779297, //PosAt
    ],
    [
        "Индивидуальность персонажа",
        "info",
        "Ваш персонаж действительно сможет стать уникальным в этом ему поможет огромный выбор одежды, масок, причесок, косметики, более 500 принтов на одежду, а так же более 1200 татуировок и возможность нанести их буквально на все тело.",
        -1345.42822265625, -1281.154052734375, 5.984735488891602, //PosCam
        -1338.4296875, -1279.1383056640625, 6.195988178253174, //PosAt
    ],
    [
        "Телефон",
        "info",
        "Телефон это ваше всё на нашем проекте. В нем вы сможете управлять вашей организацией, автомобилем, но не все так просто, по всему Лос Сантосу расположены вышки связи, благодаря которым вы можете делать все выше перечисленное, если вы куда-то забрели и связь пропала, то увы все возможности вашего телефона пропадают до того как вы не поймаете сигнал от ближайшей вышки.",
        1151.734375, -485.2276611328125, 67.4794692993164, //PosCam
        1141.753662109375, -477.53741455078125, 67.4745864868164, //PosAt
    ],
    [
        "Погода",
        "info",
        "Времена года со своими особенностями, зимой оденьтесь потеплее, летом полегче. Сильные ветра, шторма от которых появляются огромные волны в океане. Поэтому не забывайте следить за прогнозом погоды.",
        -2202.603759765625, 5128.7548828125, 20.117733001708984, //PosCam
        -2162.006591796875, 5053.60693359375, 20.107389450073242, //PosAt
    ],
    [
        "Всего хорошего",
        "info",
        "Желаем приятной игры и успехов на нашем проекте. Обязательно заходите к нам в дискорд",
        571.7979125976562, 449.5206604003906, 187.78250122070312, //PosCam
        402.3078308105469, 369.1034851074219, 187.76979064941406, //PosAt
    ],
];

let longPos = [
    [
        "Добро пожаловать",
        "info",
        "Добро пожаловать на State 99, уникальный Role Play сервер, где вы точно будете удивлены вашими возможностями. Скорее всего у вас возникнет вопрос что же уникального у нас есть? Тогда нажимайте далее и начинайте знакомство с нашим сервером.",
        913.1425170898438, -971.4676513671875, 83.99275207519531, //PosCam
        771.209228515625, -933.2013549804688, 83.9709701538086, //PosAt
    ],
    [
        "Работа",
        "info",
        "Для успешной жизни на нашем проекте вам необходимо работать, ведь одежда, машина, еда сами себя не купят.",
        1085.2498779296875, -3251.16650390625, 32.48792266845703, //PosCam
        1013.2471313476562, -3172.10986328125, 12.62631607055664, //PosAt
    ],
    [
        "Покупка транспорта",
        "info",
        "На нашем сервере вы можете иметь одну машину без какой либо жилой недвижимости, а всего количество ваших машин может доходить до 10. Купив машину вы сможете воспользоваться услугами LSC и улучшить её путем тюнинга. Не забываете о том что каждый тип ТС заправляется уникальным видом топлива. И да, у каждого транспорта уникальные характеристики, имейте ввиду!",
        -811.811279296875, -261.92950439453125, 41.11868667602539, //PosCam
        -797.8977661132812, -229.74856567382812, 36.07963943481445, //PosAt
    ],
    [
        "Недвижимость",
        "info",
        "На сервере есть несколько типов жилой недвижимости - это дома, квартиры, апартаменты, яхты и прочее. Особенность домов заключается в том что у многих из них есть свой гараж (Их может быть целых 3 сразу), где вы сможете спокойно оставлять ваш транспорт не боясь за его сохранность.",
        -1579.270751953125, 22.182931900024414, 91.5652084350586, //PosCam
        -1532.903564453125, 113.92567443847656, 68.64871978759766, //PosAt
    ],
    [
        "Бизнес",
        "info",
        "Как только накопите кругленькую сумму денег вы сможете позволить себе покупку бизнеса, будь то магазина оружия, одежды или же автомастерская, выбор огромен и мы уверены что он вас удивит.",
        -68.30360412597656, -617.302978515625, 39.792640686035156, //PosCam
        -118.74618530273438, -602.749755859375, 63.64939880371094, //PosAt
    ],
    [
        "Организации",
        "info",
        "На сервере присутствуют различные фракции в которые вы можете попасть: Полицейский департамент, Шериф департамент, Правительство, Скорая медицинская помощь, Редакторы новостей и конечно же различные банды и иные организации.",
        195.79396057128906, -973.33203125, 30.070783615112305, //PosCam
        178.76756286621094, -879.310546875, 85.98474884033203, //PosAt
    ],
    [
        "Правительство",
        "info",
        "Это здание правительства, именно тут вы будете получать ваши лицензии, так же правительство занимается финансированием государственных структур, разработкой законов и управление штатом San Andreas.",
        -1266.74951171875, -551.02197265625, 31.045982360839844, //PosCam
        -1274.946533203125, -557.583251953125, 33.827117919921875, //PosAt
    ],
    [
        "Больница",
        "info",
        "На проекте присутствуют 3 функционирующие больницы, если вам вдруг нужно пополнить ваше здоровье, то вы всегда сможете обратиться к врачам с такой просьбой.",
        231.00865173339844, -630.8092651367188, 64.2746810913086, //PosCam
        292.16180419921875, -591.9808349609375, 48.75017547607422, //PosAt
    ],
    [
        "Тюрьма",
        "info",
        "Тюрьма Болингброук является местом где сидят свой срок простые заключенные нарушавшие закон штата San Andreas, а так же люди нарушившие правила проекта, поэтому рекомендуем вам ознакомиться с ними более подробно",
        1892.854736328125, 2605.697998046875, 61.64064025878906, //PosCam
        1848.3294677734375, 2604.143310546875, 57.865928649902344, //PosAt
    ],
    [
        "Полицейский департамент",
        "info",
        "Осуществляет контроль и предотвращает деятельность преступных организаций на территории города Los Santos.",
        381.0001525878906, -1051.800537109375, 48.029239654541016, //PosCam
        418.31781005859375, -1010.1480712890625, 34.49566650390625, //PosAt
    ],
    [
        "Шериф департамент",
        "info",
        "Осуществляет контроль и предотвращает деятельность преступных организаций на территории округа Blaine.",
        -399.3052673339844, 6041.08642578125, 44.18123245239258, //PosCam
        -449.07037353515625, 6023.92138671875, 35.60549545288086, //PosAt
    ],
    [
        "Invader Новости",
        "info",
        "Именно в этом месте редакторы будут допускать ваши объявления в массы, писать новости и проводить различные мероприятия",
        -1032.0250244140625, -177.96649169921875, 56.615455627441406, //PosCam
        -1048.4959716796875, -224.66526794433594, 43.165470123291016, //PosAt
    ],
    [
        "Банки",
        "info",
        "На проекте присутсвуют 4 различных банка, такие как: Blaine, Fleeca, Maze и Pacific. Клиентом какого банка станет Ваш персонаж зависит только от Вас.",
        -1219.3525390625, -311.68804931640625, 39.45372772216797, //PosCam
        -1214.1444091796875, -326.54693603515625, 39.62767028808594, //PosAt
    ],
    [
        "Магазины 24/7",
        "info",
        "Вы должны кушать и пить что бы ваш персонаж чувствовал себя хорошо, все необходимые продукты вы сможете купить в любом магазине 24/7",
        374.5087890625, 315.26971435546875, 105.27666473388672, //PosCam
        376.79522705078125, 322.85040283203125, 104.2768325805664, //PosAt
    ],
    [
        "Магазины алкоголя",
        "info",
        "В данных магазинах продается алкоголь и сигареты, главное не переборщите",
        -1232.197265625, -894.4256591796875, 13.029080390930176, //PosCam
        -1227.3065185546875, -901.3671264648438, 12.994074821472168, //PosAt
    ],
    [
        "Магазини электроники",
        "info",
        "Тут вы сможете приобрести часы, телефон и многое другое",
        -649.8018188476562, -850.2178344726562, 25.697473526000977, //PosCam
        -654.877197265625, -854.7681274414062, 25.71078109741211, //PosAt
    ],
    [
        "Аптеки",
        "info",
        "Здесь можно приобрести все необходимые лекарства",
        312.6539611816406, -736.3862915039062, 31.250377655029297, //PosCam
        307.6886901855469, -734.6808471679688, 30.044687271118164, //PosAt
    ],
    [
        "Магазины одежды",
        "info",
        "Тут вы сможете одеть своего персонажа, не забывайте о том что одежда должна быть по погоде, иначе Ваш персонаж может замёрзнуть. Так же Вы сможете нанести любой из 500 принтов на свою одежду или купить маску по вкусу.",
        -144.91470336914062, -310.2363586425781, 40.830909729003906, //PosCam
        -156.061767578125, -305.72991943359375, 39.452362060546875, //PosAt
    ],
    [
        "Магазины оружия",
        "info",
        "Тут вы можете приобрести разнообразное бронежилеты, оружие, а так же уникальные модификации для этого же оружия. Не забывайте о том что для покупки вам понадобится лицензия на оружие, которую можно получить в полицейском участке или шериф департаменте.",
        23.06002426147461, -1131.1754150390625, 31.285785675048828, //PosCam
        19.276412963867188, -1116.9686279296875, 29.66730499267578, //PosAt
    ],
    [
        "Магазин охоты",
        "info",
        "Тут вы сможете приобрести себе стяжки, сумки и многое другое.",
        -684.460693359375, 5827.4658203125, 18.159549713134766, //PosCam
        -678.463623046875, 5832.833984375, 17.45456886291504, //PosAt
    ],
    [
        "Рыболовный магазин",
        "info",
        "Тут вы сможете приобрести всё необходимое для рыбалки",
        -1606.643798828125, 5215.94580078125, 6.667591094970703, //PosCam
        -1602.534912109375, 5205.14990234375, 4.555448055267334, //PosAt
    ],
    [
        "Парикмахерские",
        "info",
        "Измените вид вашего персонажа, причёски, бороды, косметика и многое другое",
        -29.176490783691406, -138.9762725830078, 58.14921188354492, //PosCam
        -31.36901092529297, -145.6033172607422, 57.557762145996094, //PosAt
    ],
    [
        "Тату салоны",
        "info",
        "Тут вы сможете забить вашего персонажа татуировками, всего их более 1200 штук. Учтите, в разных тату салонах, разные татуировки",
        1317.0701904296875, -1644.4881591796875, 53.0024528503418, //PosCam
        1320.7022705078125, -1649.513427734375, 52.39353942871094, //PosAt
    ],
    [
        "Бары и клубы",
        "info",
        "Место где ваш персонаж сможет отдохнуть, потанцевать и провести хорошо время.",
        138.5335235595703, -1322.213623046875, 34.98386001586914, //PosCam
        132.16905212402344, -1304.4293212890625, 32.036659240722656, //PosAt
    ],
    [
        "Автомастерские",
        "info",
        "Место где происходит обслуживание вашего транспорта, а также его покраска и тюнинг.",
        -206.65155029296875, -1297.2369384765625, 35.672306060791016, //PosCam
        -205.7047576904297, -1309.8116455078125, 31.991004943847656, //PosAt
    ],
    [
        "Ваши навыки",
        "info",
        "И главное, не забывайте прокачивать ваши навыки, от навыков персонаж становится выносливее и сильнее.",
        -1167.6917724609375, -1579.2855224609375, 16.000734329223633, //PosCam
        -1196.5576171875, -1569.73828125, 8.049470901489258, //PosAt
    ],
    [
        "Всего хорошего",
        "info",
        "Желаем приятной игры и успехов на нашем проекте. Обязательно заходите к нам в дискорд по ссылке: https://dscrd.in/dn",
        -2313.385498046875, -1008.84716796875, 13.89003849029541, //PosCam
        -2200.876708984375, -994.734130859375, 13.887266159057617, //PosAt
    ],
];

edu.startShort = function() {

    if (user.getCache('wanted_level') > 0) {
        mp.game.ui.notifications.show("~r~Вы в розыске, обучение не доступно");
        return;
    }

    isShort = true;
    edu.init();
    edu.nextShort();
};

edu.startLong = function() {

    if (user.getCache('wanted_level') > 0) {
        mp.game.ui.notifications.show("~r~Вы в розыске, обучение не доступно");
        return;
    }

    isLong = true;
    edu.init();
    edu.nextLong();
};

edu.init = function() {
    ui.hideHud();
    backPos = mp.players.local.position;
    edu.createCamera();
    user.setAlpha(0);
    mp.players.local.freezePosition(true);
    mp.players.local.setCollision(false, true);
    mp.gui.cursor.show(true, true);
    methods.disableAllControls(true);
    chat.show(false);
    chat.activate(false);

    methods.blockKeys(true);

    user.setCurrentWeapon('weapon_unarmed');
    mp.attachmentMngr.shutdownFor(mp.players.local);
};

edu.nextShort = async function() {

    if ((shortPos.length) <= step) {
        edu.stopAll();
        return;
    }

    ui.hideHud();
    let currentPos = shortPos[step];

    user.teleport(currentPos[3], currentPos[4], currentPos[5] - 20, 0, false);
    await methods.sleep(500);

    camera.setCoord(currentPos[3], currentPos[4], currentPos[5]);
    camera.pointAtCoord(currentPos[6], currentPos[7], currentPos[8]);

    await methods.sleep(500);
    ui.showDialog(currentPos[2], currentPos[0], currentPos[1],['Далее'], ui.dialogTypes.left);
    step++;
};

edu.nextLong = async function() {
    if ((longPos.length) <= step) {
        edu.stopAll();
        return;
    }

    ui.hideHud();
    let currentPos = longPos[step];

    user.teleport(currentPos[3], currentPos[4], currentPos[5] - 20, 0, false);
    await methods.sleep(500);

    camera.setCoord(currentPos[3], currentPos[4], currentPos[5]);
    camera.pointAtCoord(currentPos[6], currentPos[7], currentPos[8]);

    await methods.sleep(500);
    ui.showDialog(currentPos[2], currentPos[0], currentPos[1],['Далее'], ui.dialogTypes.left);
    step++;
};

edu.isShort = function() {
    return isShort;
};

edu.isLong = function() {
    return isLong;
};

edu.stopAll = async function() {

    user.teleportv(backPos);
    await methods.sleep(500);

    step = 0;

    user.setAlpha(255);
    mp.players.local.freezePosition(false);
    mp.players.local.setCollision(true, true);
    mp.gui.cursor.show(false, false);
    methods.disableAllControls(false);
    chat.show(true);
    chat.activate(true);

    methods.blockKeys(false);

    edu.destroyCamera();
    mp.attachmentMngr.initFor(mp.players.local);

    isShort = false;
    isLong = false;
};

edu.createCamera = function() {
    camera = mp.cameras.new("edu_camera");
    camera.setActive(true);
    camera.shake("HAND_SHAKE", 0.3);
    mp.game.cam.renderScriptCams(true, false, 0, false, false);
};

edu.destroyCamera = function() {
    try {
        if (camera) {
            camera.destroy();
            camera = null;
        }
    }
    catch (e) {
        methods.debug(e);
    }

    mp.game.cam.renderScriptCams(false, true, 0, true, true);
};

mp.events.add('client:events:dialog:onClose', function () {
    if (camera)
        edu.stopAll();
});

mp.events.add('client:events:dialog:click', function () {
    if (camera && isShort)
        edu.nextShort();
    if (camera && isLong)
        edu.nextLong();
});

export default edu;