let items = exports;

items.recipes = [
    {
        id: 0, name: "Большая аптечка", desc: `Данная аптечка восстанавливает до 100% здоровья.~br~Ресурсы для создания: бинт 2шт, маленькая аптечка`,
        craft: ['215', '216', '216'], craft_time: 5000
    },
    {
        id: 1, name: "Малая аптечка", desc: `Данная аптечка восстанавливает до 60% здоровья.~br~Ресурсы для создания: бинт 3шт`,
        craft: ['216', '216', '216'], craft_time: 5000
    },
    {
        id: 2, name: "Бинт (2шт)", desc: `Ресурсы для создания: Ткань`,
        craft: ['475'], craft_time: 5000
    },
    {
        id: 3, name: "Улучшенная удочка", desc: `Возможность ловить редкую рыбу.~br~Ресурсы для создания: Плотная леска, Улучшенный крючок, Удочка`,
        craft: ['478', '479', '251'], craft_time: 5000
    },
    {
        id: 4, name: "Костёр", desc: `Ресурсы для создания: Дрова, Зажигалка`,
        craft: ['482', '484'], craft_time: 5000
    },
    {
        id: 5, name: "Бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина`,
        craft: ['475', '475', '476'], craft_time: 5000
    },
    {
        id: 6, name: "Камуфляжный бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина, баллончик с краской`,
        craft: ['475', '475', '476', '477'], craft_time: 5000
    },
    {
        id: 7, name: "Зел. камуфляжный бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина, баллончик с краской`,
        craft: ['475', '475', '476', '477'], craft_time: 5000
    },
    {
        id: 8, name: "Зелёный бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина, баллончик с краской`,
        craft: ['475', '475', '476', '477'], craft_time: 5000
    },
    {
        id: 9, name: "Оранжевый бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина, баллончик с краской`,
        craft: ['475', '475', '476', '477'], craft_time: 5000
    },
    {
        id: 10, name: "Фиолетовый бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина, баллончик с краской`,
        craft: ['475', '475', '476', '477'], craft_time: 5000
    },
    {
        id: 11, name: "Розовый бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина, баллончик с краской`,
        craft: ['475', '475', '476', '477'], craft_time: 5000
    },
    {
        id: 12, name: "Красный бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина, баллончик с краской`,
        craft: ['475', '475', '476', '477'], craft_time: 5000
    },
    {
        id: 13, name: "Синий бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина, баллончик с краской`,
        craft: ['475', '475', '476', '477'], craft_time: 5000
    },
    {
        id: 14, name: "Серый бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина, баллончик с краской`,
        craft: ['475', '475', '476', '477'], craft_time: 5000
    },
    {
        id: 15, name: "Бежевый бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина, баллончик с краской`,
        craft: ['475', '475', '476', '477'], craft_time: 5000
    },
    {
        id: 16, name: "Белый бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина, баллончик с краской`,
        craft: ['475', '475', '476', '477'], craft_time: 5000
    },
    {
        id: 17, name: "Чёрный бронежилет", desc: `Ресурсы для создания: Ткань 2шт, стальная пластина, баллончик с краской`,
        craft: ['475', '475', '476', '477'], craft_time: 5000
    },
    {
        id: 18, name: "Raging Bull Mk II", desc: `Ресурсы для создания: Raging Bull 2шт, Стальная пластина 4шт`,
        craft: ['476', '476', '476', '476', '74', '74'], craft_time: 10000
    },
    {
        id: 19, name: "Raging Bull Mk I", desc: `Ресурсы для создания: Стальная пластина 6шт`,
        craft: ['476', '476', '476', '476', '476', '476'], craft_time: 10000
    },
];

items.itemList = [
    /*Имя, хеш объекта, может экипировать, вес, объем (ширина * на длинну * на высоту), цены */
    ['Стяжки', '', 0, -1145063624, 50, 100, 25], //0
    ['Мешок', '', 0, -1194335261, 100, 2400, 50], //1

    ['Кокаин', '', 0, 1808635348, 1, 1, 111111], //2
    ['Марихуана', '', 0, 671777952, 1, 5, 111111], //3

    ['Отмычка', '', 0, -1803909274, 50, 6, 100], //4
    ['Спец. отмычка', '', 0, -1803909274, 50, 6, 100], //5
    ['Набор инструментов', '', 0, 648185618, 4500, 12800, 250], //6

    ['Электронные часы "IFruit"', '', 0, 1169295068, 190, 110, 620], //7

    ['Канистра (Авиатопливо)', 'weapon_petrolcan', 0, 1069395324, 10000, 11300, 30], //8
    ['Канистра (Бензин)', 'weapon_petrolcan', 0, 1069395324, 10000, 11300, 15], //9
    ['Канистра (Дизель)', 'weapon_petrolcan', 0, 1069395324, 10000, 11300, 11], //10

    ["Phat Chips со вкусом сыра", "", 0, 1108364521, 225, 600, 20], //11
    ["Баночка томатного супа No. 1", "", 0, 910205311, 300, 400, 40], //12
    ["Шоколадка Zebra", "", 0, -1803909274, 50, 100, 10], //13
    ["Жвачка Release с мятой", "", 0, -1803909274, 20, 70, 5], //14
    ["Лапша Noodles с курицей", "", 0, 910205311, 150, 450, 20], //15
    ["Лапша Noodles с морепродуктами", "", 0, 910205311, 150, 450, 20], //16
    ["Пончик Rusty Brown`s ", "", 0, -1803909274, 60, 100, 15], //17
    ["Конфеты Sweet Nothings", "", 0, -1803909274, 25, 70, 18], //18
    ["Йогурт Biotic Life", "", 0, 936464539, 200, 300, 8], //19
    ["Коробка хлопьев Rails", "", 0, 910205311, 500, 2000, 30], //20
    ["Пастила P`s & Q`s", "", 0, -1803909274, 50, 100, 5], //21
    ["Яблоко", "", 0, 910205311, 200, 350, 10], //22
    ["Апельсин", "", 0, 910205311, 150, 300, 10], //23
    ["Груша", "", 0, 910205311, 180, 320, 10], //24
    ["Банан", "", 0, 1108364521, 250, 500, 10], //25
    ["Пачка сигарет RedWood", "", 0, -593364948, 40, 200, 20], //26

    ['Телефон IFruit', '', 0, -1038739674, 120, 156, 2600], //27
    ['Телефон Facade', '', 0, 1907022252, 120, 156, 550], //28
    ['Телефон IPhone', '', 0, -1038739674, 120, 156, 1200], //29
    ['Телефон BitterSweet', '', 0, -2017357667, 120, 156, 1200], //30

    ['Адреналин', '', 0, -1282296755, 50, 6, 350], //31
    ['Сухпаек', '', 0, 9168982, 2000, 5800, 270], //32
    ['Уголь', '', 0, -756465278, 40, 6, 100], //33
    ['Сироп', '', 0, -756465278, 75, 3, 120], //34
    ['Cосудосуживающий таблетка', '', 0, -756465278, 30, 6, 200], //35
    ['Таблетка от кашля', '', 0, -756465278, 40, 6, 150], //36
    ['Витаминки', '', 0, -756465278, 55, 6, 80], //37
    ['Жаропонижающий', '', 0, -756465278, 35, 6, 100], //38
    ['Антибиотик', '', 0, -756465278, 35, 6, 250], //39

    ['Наручники', '', 0, -1281059971, 340, 120, 500], //40

    ['Ключ от тс', '', 0, 977923025, 6, 3, 111111], //41
    ['Ключ от офиса', '', 0, -331172978, 6, 3, 111111], //42
    ['Ключ от дома', '', 0, -331172978, 6, 3, 111111], //43
    ['Ключ от квартиры', '', 0, -331172978, 6, 3, 111111], //44

    ['Слот', '', 0, 9168982, 650, 2800, 111111], //45
    ['Слот', '', 0, 9168982, 650, 3800, 111111], //46

    ['Модуль удаленного доступа', '', 0, -1964402432, 250, 170, 990], //47
    ['Кошелёк', '', 0, -34897201, 120, 150, 400], //48
    ['Документ', '', 0, 406712611, 80, 410, 20000], //49
    ['Банковская карта', '', 0, -1282513796, 15, 8, 111111], //50
    ['Паспорт', '', 0, -1750183478, 40, 16, 111111], //51
    ['Лицензия', '', 0, -925658112, 30, 116, 111111], //52
    ['Удостоверение', '', 0, -1595369626, 15, 8, 111111], //53

    ['Кавалерийский кинжал', 'weapon_dagger', 0, 601713565, 400, 450, 250], //54
    ['Бейсбольная бита', 'weapon_bat', 0, 32653987, 1500, 2000, 50], //55
    ['Боевой топор', 'weapon_battleaxe', 0, 3406411762, 2200, 2400, 500], //56
    ['Розочка', 'weapon_bottle', 0, 1150762982, 110, 540, 5], //57
    ['Лом', 'weapon_crowbar', 0, 1862268168, 3200, 1050, 70], //58
    ['Фонарик', 'weapon_flashlight', 0, 2278481040, 340, 400, 70], //59
    ['Клюшка для гольфа', 'weapon_golfclub', 0, 3714771050, 2900, 1150, 100], //60
    ['Молоток', 'weapon_hammer', 0, 64104227, 860, 430, 50], //61
    ['Топорик', 'weapon_hatchet', 0, 1653948529, 930, 860, 400], //62
    ['Нож', 'weapon_knife', 0, 2312523967, 560, 520, 110], //63
    ['Кастет', 'weapon_knuckle', 0, 3005998612, 450, 80, 100], //64
    ['Мачете', 'weapon_machete', 0, 2581077369, 1120, 525, 230], //65
    ['Полицейская дубинка', 'weapon_nightstick', 0, 2659989060, 880, 970, 300], //66
    ['Разводной ключ', 'weapon_wrench', 0, 3149643023, 1760, 1490, 99], //67
    ['Бильярдный кий', 'weapon_poolcue', 0, 559432947, 470, 160, 150], //68
    ['Выкидной нож', 'weapon_switchblade', 0, 3331136096, 130, 60, 130], //69

    ['Сolt SCAMP', 'weapon_appistol', 0, 905830540, 1500, 950, 1700], //70
    ['P99', 'weapon_combatpistol', 0, 403140669, 800, 660, 1100], //71
    ['Сигнальный пистолет', 'weapon_flaregun', 0, 1349014803, 440, 270, 700], //72
    ['Remington 1911', 'weapon_heavypistol', 0, 1927398017, 1120, 850, 2500], //73
    ['Raging Bull', 'weapon_revolver', 0, 914615883, 1440, 1080, 1700], //74
    ['Raging Bull Mk II', 'weapon_revolver_mk2', 0, 4065179617, 1990, 1080, 2200], //75
    ['Contender G2', 'weapon_marksmanpistol', 0, 4191177435, 1360, 1800, 1800], //76
    ['Taurus PT92', 'weapon_pistol', 0, 1467525553, 950, 1230, 560], //77
    ['Beretta 90Two', 'weapon_pistol_mk2', 0, 995074671, 920, 1050, 840], //78
    ['Desert Eagle', 'weapon_pistol50', 0, 4116483281, 1700, 1720, 1800], //79
    ['HK P7M10', 'weapon_snspistol', 0, 339962010, 785, 660, 340], //80
    ['Colt Junior', 'weapon_snspistol_mk2', 0, 4221916961, 365, 310, 900], //81
    ['Шокер', 'weapon_stungun', 0, 1609356763, 760, 680, 500], //82
    ['FN Model 1922', 'weapon_vintagepistol', 0, 3170921020, 700, 720, 800], //83
    ['Colt New Service', 'weapon_doubleaction', 0, 2050882666, 1450, 1170, 1300], //84

    ['UTS-15', 'weapon_assaultshotgun', 0, 1255410010, 2800, 11500, 3000], //85
    ['KSG 12', 'weapon_bullpupshotgun', 0, 2696754462, 3100, 9500, 2600], //86
    ['Обрез', 'weapon_dbshotgun', 0, 222483357, 1410, 1800, 1500], //87
    ['Сайга-12К', 'weapon_heavyshotgun', 0, 3085098415, 3500, 10900, 2000], //88
    ['Land Pattern Musket', 'weapon_musket', 0, 1652015642, 4300, 14400, 1300], //89
    ['Benelli M3', 'weapon_pumpshotgun', 0, 689760839, 4500, 16100, 1700], //90
    ['Benelli M4', 'weapon_pumpshotgun_mk2', 0, 3194406291, 3500, 17600, 1900], //91
    ['Mossberg 500', 'weapon_sawnoffshotgun', 0, 3619125910, 2100, 3800, 1400], //92
    ['Protecta', 'weapon_autoshotgun', 0, 1380588314, 2900, 6800, 2200], //93

    ['P-90', 'weapon_assaultsmg', 0, 3821393119, 2800, 8800, 1700], //94
    ['Mk 48', 'weapon_combatmg', 0, 3555572849, 8000, 16000, 20000], //95
    ['HK MG4', 'weapon_combatmg_mk2', 0, 2969831089, 8150, 17600, 25000], //96
    ['SIG MPX-SD', 'weapon_combatpdw', 0, 2901952492, 2700, 5000, 1700], //97
    ['Thompson M1918A1', 'weapon_gusenberg', 0, 574348740, 8400, 18400, 2700], //98
    ['Intratec TEC-9', 'weapon_machinepistol', 0, 3963421467, 1500, 1660, 1300], //99
    ['ПКП «Печенег»', 'weapon_mg', 1, 2238602894, 8200, 17250, 18000], //100
    ['Mini Uzi', 'weapon_microsmg', 0, 3238253642, 2650, 2500, 1500], //101
    ['Scorpion vz.61', 'weapon_minismg', 0, 3322144245, 2000, 1900, 1400], //102
    ['MP5A3', 'weapon_smg', 0, 3794909300, 3200, 7800, 1800], //103
    ['MP5K', 'weapon_smg_mk2', 0, 2547423399, 3350, 8100, 2300], //104

    ['TAR-21', 'weapon_advancedrifle', 0, 2587382322, 3270, 12400, 2000], //105
    ['AK-102', 'weapon_assaultrifle', 0, 273925117, 3200, 14700, 2700], //106
    ['AK-103', 'weapon_assaultrifle_mk2', 0, 1762764713, 3600, 16200, 3200], //107
    ['QBZ-97', 'weapon_bullpuprifle', 0, 3006407723, 3250, 13500, 2200], //108
    ['QBZ-95', 'weapon_bullpuprifle_mk2', 0, 1415744902, 3350, 13900, 2800], //109
    ['HK-416', 'weapon_carbinerifle', 0, 1026431720, 3490, 14200, 2500], //110
    ['HK-416A5', 'weapon_carbinerifle_mk2', 0, 1520780799, 3560, 14900, 3000], //111
    ['AKS-74u', 'weapon_compactrifle', 0, 1931114084, 2400, 5700, 3000], //112
    ['G36C', 'weapon_specialcarbine', 0, 2549323539, 2980, 12000, 2500], //113
    ['G36KV', 'weapon_specialcarbine_mk2', 0, 2379721761, 3370, 13900, 3000], //114

    ['M107', 'weapon_heavysniper', 0, 3548001216, 13500, 21000, 27000], //115
    ['XM109', 'weapon_heavysniper_mk2', 0, 619715967, 14000, 24500, 35000], //116
    ['M14 EBR', 'weapon_marksmanrifle', 0, 2583718658, 5100, 17800, 21000], //117
    ['SOCOM 16', 'weapon_marksmanrifle_mk2', 0, 2436666926, 5900, 18200, 24000], //118
    ['L115A3', 'weapon_sniperrifle', 0, 346403307, 6600, 14400, 23000], //119

    ['M79', 'weapon_compactlauncher', 0, 2771413813, 50, 2050, 35000], //120
    ['Пиротехническая установка', 'weapon_firework', 0, 491091384, 8500, 29000, 40000], //121
    ['M32 MGL', 'weapon_grenadelauncher', 0, 3688284050, 5300, 19500, 50000], //122
    ['FIM 92 Stinger', 'weapon_hominglauncher', 0, 1901887007, 13500, 29000, 65000], //123
    ['M134', 'weapon_minigun', 0, 422658457, 30000, 50000, 120000], //124
    ['Рельсовое оружие', 'weapon_railgun', 0, 2418461061, 14900, 22500, 170000], //125
    ['РПГ-7', 'weapon_rpg', 0, 4076109223, 6000, 46000, 45000], //126

    ['Мяч', 'weapon_ball', 0, 3911017173, 250, 310, 20], //127
    ['Дымовая гранта', 'weapon_smokegrenade', 0, 1591549914, 690, 485, 500], //128
    ['Сигнальный огонь', 'weapon_flare', 0, 2730774144, 250, 180, 250], //129
    ['Граната', 'weapon_grenade', 0, 290600267, 890, 410, 800], //130
    ['Коктейль Молотова', 'weapon_molotov', 0, 3414357965, 660, 720, 800], //131
    ['Неконтактная мина', 'weapon_proxmine', 0, 1876445962, 850, 1200, 2500], //132
    ['Самодельная бомба', 'weapon_pipebomb', 0, 4121513285, 430, 180, 3500], //133
    ['Снежок', 'weapon_snowball', 0, 1297482736, 250, 310, 1], //134
    ['Бомба-липучка', 'weapon_stickybomb', 0, 3184763647, 750, 1200, 4500], //135
    ['Слезоточивый газ', 'weapon_bzgas', 0, 1591549914, 690, 485, 4000], //136

    ['Парашют', 'gadget_parachute', 0, -1679378668, 3200, 7500, 50], //137

    ['Купюра $1', '', 0, 1814532926, 1, 1, 1], //138
    ['Купюра $100', '', 0, 1597489407, 1, 1, 100], //139
    ['Маленькая пачка $100', '', 0, -1170050911, 100, 100, 111111], //140
    ['Большая пачка $100', '', 0, -1448063107, 300, 300, 111111], //141

    ['Упаковка кокаина', '', 0, 525896218, 1000, 1000, 111111], //142
    ['Упаковка марихуаны', '', 0, -395076527, 200, 1000, 111111], //143
    ['Упаковка кокаина (Большая)', '', 0, -1688127, 5000, 5000, 111111], //144
    ['Упаковка марихуаны (Большая)', '', 0, -680115871, 800, 4000, 111111], //145

    ['Glock 17', 'weapon_ceramicpistol', 0, 1430410579, 1990, 1080, 1300], //146
    ['Colt 1851 Navy Revolver', 'weapon_navyrevolver', 0, 1430410579, 1990, 1080, 2200], //147

    ['Чертеж банка Fleeca #2', '', 0, 406712611, 80, 410, 111111], //148
    ['Чертеж банка Fleeca #4', '', 0, 406712611, 80, 410, 111111], //149
    ['Чертеж банка Pacific', '', 0, 406712611, 80, 410, 111111], //150
    ['Чертеж Humane Labs', '', 0, 1843823183, 3800, 1568, 111111], //151
    ['Чертеж хранилища Diamond Casino', '', 0, 1843823183, 1500, 1568, 111111], //152
    ['Чертеж хранилища Union Depository', '', 0, 190687980, 1140, 432, 111111], //153

    ['Кокаин (10гр)', '', 0, 1808635348, 10, 10, 111111], //154
    ['Марихуана (10гр)', '', 0, 671777952, 10, 50, 111111], //155
    ['Кокаин (50гр)', '', 0, 1808635348, 50, 50, 111111], //156
    ['Марихуана (50гр)', '', 0, 671777952, 50, 250, 111111], //157

    ['Амфетамин', '', 0, 1808635348, 1, 1, 111111], //158
    ['DMT', '', 0, 1808635348, 1, 1, 111111], //159
    ['Мефедрон', '', 0, 1808635348, 1, 1, 111111], //160
    ['Кетамин', '', 0, 671777952, 1, 5, 111111], //161
    ['LSD', '', 0, 671777952, 1, 5, 111111], //162

    ['Упаковка амфетамина', '', 0, 525896218, 1000, 1000, 111111], //163
    ['Упаковка амфетамина (Большая)', '', 0, -1688127, 5000, 5000, 111111], //164

    ['Упаковка DMT', '', 0, 525896218, 1000, 1000, 111111], //165
    ['Упаковка DMT (Большая)', '', 0, -1688127, 5000, 5000, 111111], //166

    ['Упаковка мефедрона', '', 0, 525896218, 1000, 1000, 111111], //167
    ['Упаковка мефедрона (Большая)', '', 0, -1688127, 5000, 5000, 111111], //168

    ['Упаковка кетамина', '', 0, 1430410579, 1000, 3000, 111111], //169
    ['Упаковка LSD', '', 0, 1430410579, 1000, 3000, 111111], //170

    ['Амфетамин (10гр)', '', 0, 1808635348, 10, 10, 111111], //171
    ['DMT (10гр)', '', 0, 1808635348, 10, 10, 111111], //172
    ['Мефедрон (10гр)', '', 0, 1808635348, 10, 10, 111111], //173
    ['Кетамин (10гр)', '', 0, 671777952, 10, 50, 111111], //174
    ['LSD (10гр)', '', 0, 671777952, 10, 50, 111111], //175

    ['Амфетамин (50гр)', '', 0, 1808635348, 50, 50, 111111], //176
    ['DMT (50гр)', '', 0, 1808635348, 50, 50, 111111], //177
    ['Мефедрон (50гр)', '', 0, 1808635348, 50, 50, 111111], //178
    ['Кетамин (50гр)', '', 0, 671777952, 50, 250, 111111], //179
    ['LSD (50гр)', '', 0, 671777952, 50, 250, 111111], //180

    ['Деревянный ящик Gray Tea', '', 0, -1147461795, 15000, 500000, 111111], //181
    ['Коробка Листов A4', '', 0, 1465830963, 2500, 40000, 111111], //182
    ['Коробка Redwood', '', 0, 1465830963, 2500, 35000, 111111], //183
    ['Коробка Clucking Bell', '', 0, 250374685, 15000, 70000, 111111], //184
    ['Коробка Jo Jo diet Cola', '', 0, -1244905398, 8000, 25000, 111111], //185
    ['Коробка Craft', '', 0, -517243780, 40000, 70000, 111111], //186
    ['Коробка Fish and Roll', '', 0, -1563678327, 60000, 450000, 111111], //187
    ['Деревянный ящик GoPostal', '', 0, -1649986476, 19000, 300000, 111111], //188
    ['Огромная деревянный ящик', '', 0, 1955876122, 420000, 5000000, 111111], //189
    ['Важная деревянный ящик', '', 0, 307713837, 120000, 1250000, 111111], //190
    ['Коробка из китая', '', 0, -1513883840, 35000, 450000, 111111], //191
    ['Важная коробка', '', 0, -1438964996, 12000, 250000, 111111], //192
    ['Маленькая коробка', '', 0, -721895765, 4000, 55000, 111111], //193

    ['Полосатая бочка', '', 0, 546252211, 30000, 5000, 2000], //194
    ['Ограждение со стрелкой', '', 0, 1867879106, 8000, 5000, 2000], //195
    ['Длинное ограждение', '', 0, -205311355, 10000, 5000, 2000], //196
    ['Деревянное ограждение', '', 0, 1072616162, 5000, 5000, 2000], //197
    ['Деревянное ограждение с огнём', '', 0, 1329951119, 5000, 5000, 2000], //198
    ['Полицейское огорождение', '', 0, -143315610, 9000, 5000, 2000], //199
    ['Длинный полосатый конус', '', 0, 939377219, 1000, 3000, 2000], //200
    ['Полосатый конус', '', 0, 1245865676, 1000, 3000, 2000], //201
    ['Красный конус', '', 0, 862664990, 1000, 3000, 2000], //202
    ['Длинный конус с огнями', '', 0, -1587301201, 1000, 3000, 2000], //203

    ['Капсула с таблетками', '', 0, -2127785247, 50, 25, 111111], //204
    ['Огромная стекляная бутыль', '', 0, -1382355819, 3000, 6750, 111111], //205
    ['Капсула с таблетками', '', 0, -756465278, 50, 30, 111111], //206
    ['Бутыль', '', 0, 393961710, 250, 250, 111111], //207
    ['Сироп', '', 0, 1648892290, 120, 170, 111111], //208
    ['Большая стекляная банка', '', 0, 566302905, 1500, 4200, 111111], //209
    ['Стекляная банка', '', 0, -2034834785, 500, 1400, 111111], //210
    ['Контейнер с пробирками', '', 0, -330775550, 4500, 6000, 111111], //211
    ['Контейнер для пробирок', '', 0, -192665395, 2000, 6000, 111111], //212
    ['Пробирка', '', 0, -2022085894, 500, 60, 111111], //213
    ['Шприц', '', 0, -61966571, 50, 6, 111111], //214
    ['Аптечка', '', 0, 678958360, 500, 1880, 410], //215
    ['Бинт', '', 0, 546339338, 70, 280, 40], //216
    ['Большой бинт', '', 0, 580223600, 120, 410, 111111], //217
    ['Таблетки', '', 0, -1129328507, 20, 10, 111111], //218
    ['Бутыль с перекисью водорода', '', 0, 1254553771, 3000, 8000, 111111], //219
    ['Упаковка таблеток', '', 0, 1787587532, 50, 130, 111111], //220
    ['Антипохмелин', '', 0, 1547095841, 12, 130, 80], //221
    ['Упаковка таблеток', '', 0, 1174512311, 50, 130, 111111], //222

    ['Сырое мясо тунца', '', 0, 936464539, 1000, 3000, 111111], //223
    ['Сырое мясо окуня', '', 0, 936464539, 300, 800, 111111], //224
    ['Сырое мясо краба', '', 0, 936464539, 600, 4000, 111111], //225
    ['Сырое мясо лосося', '', 0, 936464539, 290, 1000, 111111], //226
    ['Сырое мясо креветок', '', 0, 936464539, 290, 600, 111111], //227
    ['Сырое мясо рыбы', '', 0, 936464539, 300, 800, 111111], //228
    ['Сырое мясо рыбы', '', 0, 936464539, 300, 800, 111111], //229
    ['Сырое мясо рыбы', '', 0, 936464539, 300, 800, 111111], //230
    ['Сырое мясо рыбы', '', 0, 936464539, 300, 800, 111111], //231

    ['Мясо тунца', '', 0, 936464539, 1000, 3000, 111111], //232
    ['Мясо окуня', '', 0, 936464539, 300, 800, 111111], //233
    ['Мясо краба', '', 0, 936464539, 600, 4000, 111111], //234
    ['Мясо лосося', '', 0, 936464539, 290, 1000, 111111], //235
    ['Мясо креветок', '', 0, 936464539, 290, 600, 111111], //236
    ['Мясо рыбы', '', 0, 936464539, 300, 800, 111111], //237
    ['Мясо рыбы', '', 0, 936464539, 300, 800, 111111], //238
    ['Мясо рыбы', '', 0, 936464539, 300, 800, 111111], //239
    ['Мясо рыбы', '', 0, 936464539, 300, 800, 111111], //240

    ["Баночка E-Cola", "", 0, 144995201, 340, 400, 15], //241
    ["Бутылка воды Rainé", "", 0, 724797387, 500, 650, 10], //242
    ["Бутылка пива A.M.", "", 0, -1301244203, 700, 600, 31], //243
    ["Бутылка пива Stronzo", "", 0, -1301244203, 700, 600, 32], //244
    ["Бутылка пива Pißwasser", "", 0, -1301244203, 700, 600, 28], //245
    ["Бутылка пива Patriot", "", 0, -1301244203, 700, 600, 29], //246
    ["Бутылка водки Nogo", "", 0, 1925761914, 1200, 1100, 150], //247
    ["Бутылка вина Rockford Hill Reserve", "", 0, -1756838334, 1400, 1100, 2500], //248
    ["Бутылка рома Ragga", "", 0, -154609122, 700, 700, 1320], //249
    ["Бутылка коньяка Bourgeoix", "", 0, 1404018125, 700, 700, 5500], //250

    ['Удочка', '', 0, 1338703913, 3560, 4900, 800], //251
    ['Бронежилет', '', 0, 701173564, 3560, 14900, 200], //252
    ['Игральные кости', '', 0, -1803909274, 50, 6, 10], //253

    ['Маленький розовый член', '', 0, -422877666, 250, 195, 850], //254
    ['Красный вибратор ', '', 0, -463441113, 450, 440, 1000], //255
    ['Фиолетовый член', '', 0, -731262150, 330, 290, 1000], //256
    ['Кожаный член', '', 0, -1980613044, 320, 285, 1500], //257
    ['Позолоченный член', '', 0, 2009373169, 390, 180, 3000], //258
    ['Металлический член', '', 0, -1921596075, 390, 180, 2000], //259
    ['Большой резиновый член', '', 0, 1333481871, 950, 2100, 2000], //260
    ['Анальная смазка', '', 0, 1553232197, 250, 540, 800], //261

    ['C4', 'StickyBomb', 0, -1110203649, 750, 1200, 111111], //262

    ['Рюкзак', '', 0, -1158162337, 2000, 20000, 20], //263
    ['Сумка', '', 0, -1158162337, 2000, 50000, 50], //264
    ['Одежда', '', 0, -1158162337, 2000, 4500, 10], //265
    ['Штаны', '', 0, -1158162337, 2000, 4500, 10], //266
    ['Обувь', '', 0, 101151147, 1500, 3000, 10], //267
    ['Аксессуар', '', 0, 1267833770, 400, 1200, 10], //268
    ['Головной убор', '', 0, 1267833770, 500, 1500, 10], //269
    ['Очки', '', 0, 1298569174, 200, 350, 10], //270
    ['Серьги', '', 1, 1267833770, 150, 90, 10], //271
    ['Часы', '', 0, 1267833770, 250, 300, 10], //272
    ['Браслет', '', 0, 1267833770, 250, 300, 10], //273
    ['Маска', '', 0, 1267833770, 400, 1200, 10], //274
    ['Перчатки', '', 0, 1267833770, 500, 60, 10], //275

    ['Коробка спец. отмычек', '', 0, 1267833770, 1500, 180, 111111], //276

    ['Дефибриллятор', '', 0, 678958360, 500, 4880, 1750], //277
    ['Большая Аптечка', '', 0, 678958360, 500, 2880, 1000], //278

    ['Коробка патронов', '', 0, 1843823183, 3800, 1568, 111111], //279
    ['Коробка патронов 9mm', '', 0, 190687980, 1140, 432, 370], //280
    ['Коробка патронов 12 калибра', '', 0, 1560006187, 2420, 1024, 500], //281
    ['Коробка патронов 7.62mm', '', 0, 669213687, 2580, 686, 400], //282
    ['Коробка патронов 5.45mm', '', 0, 1843823183, 3620, 1568, 390], //283
    ['Коробка патронов 5.56mm', '', 0, 1843823183, 3620, 1568, 390], //284
    ['Коробка патронов 12.7mm', '', 0, 1843823183, 8900, 1568, 450], //285
    ['Коробка патронов .45 ACP', '', 0, 1843823183, 8900, 1568, 390], //286
    ['Коробка патронов .44 Magnum', '', 0, 1843823183, 8900, 1568, 390], //287
    ['Коробка патронов сингального пистолета', '', 0, 1843823183, 1600, 1568, 400], //288
    ['Коробка патронов феерверка', '', 0, 1843823183, 1600, 1568, 550], //289
    ['Коробка подствольных гранат', '', 0, 1843823183, 3800, 1568, 2000], //290
    ['Коробка патронов RPG', '', 0, 1843823183, 2200, 1568, 1500], //291
    ['Коробка патронов Stinger', '', 0, 1843823183, 1500, 1568, 1500], //292

    ['Фонарик', 'weapon_pistol', 899381934, 1130912089, 999, 999, 70], //293
    ['Глушитель', 'weapon_pistol', 1709866683, 2961024780, 999, 999, 320], //294

    ['Фонарик', 'weapon_combatpistol', 899381934, 1130912089, 999, 999, 70], //295
    ['Глушитель', 'weapon_combatpistol', -1023114086, 3269753630, 999, 999, 320], //296

    ['Фонарик', 'weapon_appistol', 899381934, 1130912089, 999, 999, 70], //297
    ['Глушитель', 'weapon_appistol', -1023114086, 3269753630, 999, 999, 320], //298

    ['Фонарик', 'weapon_pistol50', 899381934, 1130912089, 999, 999, 70], //299
    ['Глушитель', 'weapon_pistol50', -1489156508, 3861759304, 999, 999, 320], //300

    ['Фонарик', 'weapon_heavypistol', 899381934, 1130912089, 999, 999, 70], //301
    ['Глушитель', 'weapon_heavypistol', -1023114086, 3269753630, 999, 999, 320], //302

    ['Голографический прицел', 'weapon_revolver_mk2', 1108334355, 2829113236, 999, 999, 500], //303
    ['Прицел малой кратности', 'weapon_revolver_mk2', 77277509, 3146158889, 999, 999, 250], //304
    ['Фонарик', 'weapon_revolver_mk2', 899381934, 1130912089, 999, 999, 70], //305
    ['Компенсатор', 'weapon_revolver_mk2', 654802123, 3669642320, 999, 999, 400], //306

    ['Фонарик', 'weapon_snspistol_mk2', 1246324211, 3006720319, 999, 999, 70], //307
    ['Оптический прицел', 'weapon_snspistol_mk2', 2112431491, 3995252072, 999, 999, 250], //308
    ['Компенсатор', 'weapon_snspistol_mk2', -1434287169, 2097516772, 999, 999, 400], //309
    ['Глушитель', 'weapon_snspistol_mk2', 1709866683, 2961024780, 999, 999, 320], //310
    ['Фонарик', 'weapon_pistol_mk2', 1140676955, 1009734661, 999, 999, 70], //311
    ['Оптический прицел', 'weapon_pistol_mk2', -1898661008, 4293187820, 999, 999, 250], //312
    ['Глушитель', 'weapon_pistol_mk2', 1709866683, 2961024780, 999, 999, 320], //313
    ['Компенсатор', 'weapon_pistol_mk2', 568543123, 2384474905, 999, 999, 400], //314

    ['Глушитель', 'weapon_vintagepistol', -1023114086, 3269753630, 999, 999, 320], //315

    ['Глушитель', 'weapon_ceramicpistol', -1828202758, 3458054605, 999, 999, 320], //316

    ['Фонарик', 'weapon_microsmg', 899381934, 1130912089, 999, 999, 70], //317
    ['Прицел', 'weapon_microsmg', -1657815255, 3146158889, 999, 999, 440], //318
    ['Глушитель', 'weapon_microsmg', -1489156508, 3861759304, 999, 999, 320], //319

    ['Прицел', 'weapon_smg', 1019656791, 1234627046, 999, 999, 440], //320
    ['Глушитель', 'weapon_smg', -1023114086, 3269753630, 999, 999, 320], //321

    ['Фонарик', 'weapon_assaultsmg', 2076495324, 2722601028, 999, 999, 70], //322
    ['Прицел', 'weapon_assaultsmg', -1657815255, 3146158889, 999, 999, 440], //323
    ['Глушитель', 'weapon_assaultsmg', -1489156508, 3861759304, 999, 999, 320], //324

    ['Фонарик', 'weapon_smg_mk2', 2076495324, 2722601028, 999, 999, 70], //325
    ['Голографический прицел', 'weapon_smg_mk2', -1613015470, 2644166869, 999, 999, 500], //326
    ['Прицел малой кратности', 'weapon_smg_mk2', -452809877, 440096355, 999, 999, 250], //327
    ['Прицел средней кратности', 'weapon_smg_mk2', 1038927834, 1041503532, 999, 999, 250], //328
    ['Глушитель', 'weapon_smg_mk2', -1023114086, 3269753630, 999, 999, 320], //329
    ['Плоский дульный тормоз', 'weapon_smg_mk2', -1181482284, 3296361608, 999, 999, 390], //330
    ['Тактический дульный тормоз', 'weapon_smg_mk2', -932732805, 2924171306, 999, 999, 390], //331
    ['Дульный тормоз с толстым наконечником', 'weapon_smg_mk2', -569259057, 415999277, 999, 999, 390], //332
    ['Дульный тормоз повышенной точности', 'weapon_smg_mk2', -326080308, 1132722845, 999, 999, 390], //333
    ['Сверхпрочный дульный тормоз', 'weapon_smg_mk2', 48731514, 4248432134, 999, 999, 390], //334
    ['Наклонный дульный тормоз', 'weapon_smg_mk2', 880736428, 3892626332, 999, 999, 390], //335
    ['Разъемный дульный тормоз', 'weapon_smg_mk2', 1303784126, 1373968223, 999, 999, 390], //336

    ['Глушитель', 'weapon_machinepistol', -1023114086, 3269753630, 999, 999, 320], //337

    ['Фонарик', 'weapon_combatpdw', 2076495324, 2722601028, 999, 999, 70], //338
    ['Рукоятка', 'weapon_combatpdw', 202788691, 3745179589, 999, 999, 250], //339
    ['Прицел', 'weapon_combatpdw', -1439939148, 3205897199, 999, 999, 440], //340

    ['Фонарик', 'weapon_pumpshotgun', 2076495324, 2722601028, 999, 999, 70], //341
    ['Глушитель', 'weapon_pumpshotgun', -435637410, 2918601495, 999, 999, 320], //342

    ['Фонарик', 'weapon_assaultshotgun', 2076495324, 2722601028, 999, 999, 70], //343
    ['Рукоятка', 'weapon_assaultshotgun', 202788691, 3745179589, 999, 999, 250], //344
    ['Глушитель', 'weapon_assaultshotgun', -2089531990, 2127522061, 999, 999, 320], //345

    ['Фонарик', 'weapon_bullpupshotgun', 2076495324, 2722601028, 999, 999, 70], //346
    ['Рукоятка', 'weapon_bullpupshotgun', 202788691, 3745179589, 999, 999, 250], //347
    ['Глушитель', 'weapon_bullpupshotgun', -1489156508, 3861759304, 999, 999, 320], //348

    ['Голографический прицел', 'weapon_pumpshotgun_mk2', 1108334355, 2829113236, 999, 999, 500], //349
    ['Прицел малой кратности', 'weapon_pumpshotgun_mk2', 77277509, 3146158889, 999, 999, 250], //350
    ['Прицел средней кратности', 'weapon_pumpshotgun_mk2', 1060929921, 3205897199, 999, 999, 250], //351
    ['Фонарик', 'weapon_pumpshotgun_mk2', 2076495324, 2722601028, 999, 999, 70], //352
    ['Глушитель', 'weapon_pumpshotgun_mk2', -1404903567, 2042625932, 999, 999, 320], //353
    ['Дульный тормоз', 'weapon_pumpshotgun_mk2', 1602080333, 1548334207, 999, 999, 390], //354

    ['Фонарик', 'weapon_heavyshotgun', 2076495324, 2722601028, 999, 999, 70], //355
    ['Рукоятка', 'weapon_heavyshotgun', 202788691, 3745179589, 999, 999, 250], //356
    ['Глушитель', 'weapon_heavyshotgun', -1489156508, 3861759304, 999, 999, 320], //357

    ['Фонарик', 'weapon_assaultrifle', 2076495324, 2722601028, 999, 999, 70], //358
    ['Рукоятка', 'weapon_assaultrifle', 202788691, 3745179589, 999, 999, 250], //359
    ['Глушитель', 'weapon_assaultrifle', -1489156508, 3861759304, 999, 999, 320], //360
    ['Прицел', 'weapon_assaultrifle', -1657815255, 3146158889, 999, 999, 440], //361

    ['Фонарик', 'weapon_carbinerifle', 2076495324, 2722601028, 999, 999, 70], //362
    ['Рукоятка', 'weapon_carbinerifle', 202788691, 3745179589, 999, 999, 250], //363
    ['Глушитель', 'weapon_carbinerifle', -2089531990, 2127522061, 999, 999, 320], //364
    ['Прицел', 'weapon_carbinerifle', -1596416958, 4294868463, 999, 999, 440], //365

    ['Фонарик', 'weapon_advancedrifle', 2076495324, 2722601028, 999, 999, 70], //366
    ['Глушитель', 'weapon_advancedrifle', -2089531990, 2127522061, 999, 999, 320], //367
    ['Прицел', 'weapon_advancedrifle', -1439939148, 3205897199, 999, 999, 440], //368

    ['Фонарик', 'weapon_specialcarbine', 2076495324, 2722601028, 999, 999, 70], //369
    ['Рукоятка', 'weapon_specialcarbine', 202788691, 3745179589, 999, 999, 250], //370
    ['Глушитель', 'weapon_specialcarbine', -1489156508, 3861759304, 999, 999, 320], //371
    ['Прицел', 'weapon_specialcarbine', -1596416958, 999, 999, 999, 440], //372

    ['Фонарик', 'weapon_bullpuprifle', 2076495324, 2722601028, 999, 999, 70], //373
    ['Рукоятка', 'weapon_bullpuprifle', 202788691, 3745179589, 999, 999, 250], //374
    ['Глушитель', 'weapon_bullpuprifle', -2089531990, 2127522061, 999, 999, 320], //375
    ['Прицел', 'weapon_bullpuprifle', -1439939148, 3205897199, 999, 999, 440], //376

    ['Фонарик', 'weapon_bullpuprifle_mk2', 2076495324, 2722601028, 999, 999, 70], //377
    ['Голографический прицел', 'weapon_bullpuprifle_mk2', 1108334355, 2829113236, 999, 999, 500], //378
    ['Прицел малой кратности', 'weapon_bullpuprifle_mk2', -944910075, 1234627046, 999, 999, 250], //379
    ['Прицел средней кратности', 'weapon_bullpuprifle_mk2', 1060929921, 3205897199, 999, 999, 250], //380
    ['Глушитель', 'weapon_bullpuprifle_mk2', -2089531990, 2127522061, 999, 999, 320], //381
    ['Плоский дульный тормоз', 'weapon_bullpuprifle_mk2', -1181482284, 3296361608, 999, 999, 390], //382
    ['Тактический дульный тормоз', 'weapon_bullpuprifle_mk2', -932732805, 2924171306, 999, 999, 390], //383
    ['Дульный тормоз с толстым наконечником', 'weapon_bullpuprifle_mk2', -569259057, 415999277, 999, 999, 390], //384
    ['Дульный тормоз повышенной точности', 'weapon_bullpuprifle_mk2', -326080308, 1132722845, 999, 999, 390], //385
    ['Сверхпрочный дульный тормоз', 'weapon_bullpuprifle_mk2', 48731514, 4248432134, 999, 999, 390], //386
    ['Наклонный дульный тормоз', 'weapon_bullpuprifle_mk2', 880736428, 3892626332, 999, 999, 390], //387
    ['Разъемный дульный тормоз', 'weapon_bullpuprifle_mk2', 1303784126, 1373968223, 999, 999, 390], //388
    ['Рукоятка', 'weapon_bullpuprifle_mk2', -1654288262, 3058873326, 999, 999, 250], //389

    ['Фонарик', 'weapon_specialcarbine_mk2', 2076495324, 2722601028, 999, 999, 70], //390
    ['Голографический прицел', 'weapon_specialcarbine_mk2', 1108334355, 2829113236, 999, 999, 500], //391
    ['Прицел малой кратности', 'weapon_specialcarbine_mk2', 77277509, 3146158889, 999, 999, 250], //392
    ['Прицел большой кратности', 'weapon_specialcarbine_mk2', -966040254, 465859895, 999, 999, 4000], //393
    ['Глушитель', 'weapon_specialcarbine_mk2', -1489156508, 3861759304, 999, 999, 320], //394
    ['Плоский дульный тормоз', 'weapon_specialcarbine_mk2', -1181482284, 3296361608, 999, 999, 390], //395
    ['Тактический дульный тормоз', 'weapon_specialcarbine_mk2', -932732805, 2924171306, 999, 999, 390], //396
    ['Дульный тормоз с толстым наконечником', 'weapon_specialcarbine_mk2', -569259057, 415999277, 999, 999, 390], //397
    ['Дульный тормоз повышенной точности', 'weapon_specialcarbine_mk2', -326080308, 1132722845, 999, 999, 390], //398
    ['Сверхпрочный дульный тормоз', 'weapon_specialcarbine_mk2', 48731514, 4248432134, 999, 999, 390], //399
    ['Наклонный дульный тормоз', 'weapon_specialcarbine_mk2', 880736428, 3892626332, 999, 999, 390], //400
    ['Разъемный дульный тормоз', 'weapon_specialcarbine_mk2', 1303784126, 1373968223, 999, 999, 390], //401
    ['Рукоятка', 'weapon_specialcarbine_mk2', -1654288262, 3058873326, 999, 999, 250], //402

    ['Фонарик', 'weapon_assaultrifle_mk2', 2076495324, 2722601028, 999, 999, 70], //403
    ['Голографический прицел', 'weapon_assaultrifle_mk2', 1108334355, 2829113236, 999, 999, 500], //404
    ['Прицел малой кратности', 'weapon_assaultrifle_mk2', 77277509, 3146158889, 999, 999, 250], //405
    ['Прицел большой кратности', 'weapon_assaultrifle_mk2', -966040254, 465859895, 999, 999, 4000], //406
    ['Глушитель', 'weapon_assaultrifle_mk2', -1489156508, 3861759304, 999, 999, 320], //407
    ['Плоский дульный тормоз', 'weapon_assaultrifle_mk2', -1181482284, 3296361608, 999, 999, 390], //408
    ['Тактический дульный тормоз', 'weapon_assaultrifle_mk2', -932732805, 2924171306, 999, 999, 390], //409
    ['Дульный тормоз с толстым наконечником', 'weapon_assaultrifle_mk2', -569259057, 415999277, 999, 999, 390], //410
    ['Дульный тормоз повышенной точности', 'weapon_assaultrifle_mk2', -326080308, 1132722845, 999, 999, 390], //411
    ['Сверхпрочный дульный тормоз', 'weapon_assaultrifle_mk2', 48731514, 4248432134, 999, 999, 390], //412
    ['Наклонный дульный тормоз', 'weapon_assaultrifle_mk2', 880736428, 3892626332, 999, 999, 390], //413
    ['Разъемный дульный тормоз', 'weapon_assaultrifle_mk2', 1303784126, 1373968223, 999, 999, 390], //414
    ['Рукоятка', 'weapon_assaultrifle_mk2', -1654288262, 3058873326, 999, 999, 250], //415

    ['Фонарик', 'weapon_carbinerifle_mk2', 2076495324, 2722601028, 999, 999, 70], //416
    ['Голографический прицел', 'weapon_carbinerifle_mk2', 1108334355, 2829113236, 999, 999, 500], //417
    ['Прицел малой кратности', 'weapon_carbinerifle_mk2', 77277509, 3146158889, 999, 999, 250], //418
    ['Прицел большой кратности', 'weapon_carbinerifle_mk2', -966040254, 465859895, 999, 999, 4000], //419
    ['Глушитель', 'weapon_carbinerifle_mk2', -2089531990, 2127522061, 999, 999, 320], //420
    ['Плоский дульный тормоз', 'weapon_carbinerifle_mk2', -1181482284, 3296361608, 999, 999, 390], //421
    ['Тактический дульный тормоз', 'weapon_carbinerifle_mk2', -932732805, 2924171306, 999, 999, 390], //422
    ['Дульный тормоз с толстым наконечником', 'weapon_carbinerifle_mk2', -569259057, 415999277, 999, 999, 390], //423
    ['Дульный тормоз повышенной точности', 'weapon_carbinerifle_mk2', -326080308, 1132722845, 999, 999, 390], //424
    ['Сверхпрочный дульный тормоз', 'weapon_carbinerifle_mk2', 48731514, 4248432134, 999, 999, 390], //425
    ['Наклонный дульный тормоз', 'weapon_carbinerifle_mk2', 880736428, 3892626332, 999, 999, 390], //426
    ['Разъемный дульный тормоз', 'weapon_carbinerifle_mk2', 1303784126, 1373968223, 999, 999, 390], //427
    ['Рукоятка', 'weapon_carbinerifle_mk2', -1654288262, 3058873326, 999, 999, 250], //428

    ['Прицел', 'weapon_mg', 1006677997, 1517447672, 999, 999, 440], //429

    ['Прицел', 'weapon_combatmg', -1596416958, 4294868463, 999, 999, 440], //430
    ['Рукоятка', 'weapon_combatmg', 202788691, 3745179589, 999, 999, 250], //431

    ['Голографический прицел', 'weapon_combatmg_mk2', 1108334355, 2829113236, 999, 999, 500], //432
    ['Прицел средней кратности', 'weapon_combatmg_mk2', 1060929921, 3205897199, 999, 999, 250], //433
    ['Прицел большой кратности', 'weapon_combatmg_mk2', -966040254, 465859895, 999, 999, 4000], //434
    ['Плоский дульный тормоз', 'weapon_combatmg_mk2', -1181482284, 3296361608, 999, 999, 390], //435
    ['Тактический дульный тормоз', 'weapon_combatmg_mk2', -932732805, 2924171306, 999, 999, 390], //436
    ['Дульный тормоз с толстым наконечником', 'weapon_combatmg_mk2', -569259057, 415999277, 999, 999, 390], //437
    ['Дульный тормоз повышенной точности', 'weapon_combatmg_mk2', -326080308, 1132722845, 999, 999, 390], //438
    ['Сверхпрочный дульный тормоз', 'weapon_combatmg_mk2', 48731514, 4248432134, 999, 999, 390], //439
    ['Наклонный дульный тормоз', 'weapon_combatmg_mk2', 880736428, 3892626332, 999, 999, 390], //440
    ['Разъемный дульный тормоз', 'weapon_combatmg_mk2', 1303784126, 1373968223, 999, 999, 390], //441
    ['Рукоятка', 'weapon_combatmg_mk2', -1654288262, 3058873326, 999, 999, 250], //442

    ['Прицел', 'weapon_sniperrifle', -767279652, 902783233, 999, 999, 440], //443
    ['Модернизированный прицел', 'weapon_sniperrifle', -1135289737, 514930793, 999, 999, 250], //444

    ['Прицел', 'weapon_heavysniper', -767279652, 902783233, 999, 999, 440], //445
    ['Модернизированный прицел', 'weapon_heavysniper', -1135289737, 514930793, 999, 999, 250], //446

    ['Фонарик', 'weapon_marksmanrifle_mk2', 2076495324, 2722601028, 999, 999, 70], //447
    ['Голографический прицел', 'weapon_marksmanrifle_mk2', 1108334355, 2829113236, 999, 999, 500], //448
    ['Кратный прицел', 'weapon_marksmanrifle_mk2', 1528590652, 902783233, 999, 999, 2750], //449
    ['Прицел большой кратности', 'weapon_marksmanrifle_mk2', -966040254, 465859895, 999, 999, 4000], //450
    ['Глушитель', 'weapon_marksmanrifle_mk2', -2089531990, 2127522061, 999, 999, 320], //451
    ['Плоский дульный тормоз', 'weapon_marksmanrifle_mk2', -1181482284, 3296361608, 999, 999, 390], //452
    ['Тактический дульный тормоз', 'weapon_marksmanrifle_mk2', -932732805, 2924171306, 999, 999, 390], //453
    ['Дульный тормоз с толстым наконечником', 'weapon_marksmanrifle_mk2', -569259057, 415999277, 999, 999, 390], //454
    ['Дульный тормоз повышенной точности', 'weapon_marksmanrifle_mk2', -326080308, 1132722845, 999, 999, 390], //455
    ['Сверхпрочный дульный тормоз', 'weapon_marksmanrifle_mk2', 48731514, 4248432134, 999, 999, 390], //456
    ['Наклонный дульный тормоз', 'weapon_marksmanrifle_mk2', 880736428, 3892626332, 999, 999, 390], //457
    ['Разъемный дульный тормоз', 'weapon_marksmanrifle_mk2', 1303784126, 1373968223, 999, 999, 390], //458
    ['Рукоятка', 'weapon_marksmanrifle_mk2', -1654288262, 3058873326, 999, 999, 250], //459

    ['Тепловизионный прицел', 'weapon_heavysniper_mk2', 776198721, 3033675491, 999, 999, 5000], //460
    ['Прицел ночного видения', 'weapon_heavysniper_mk2', -1233121104, 3033675491, 999, 999, 4500], //461
    ['Кратный прицел', 'weapon_heavysniper_mk2', -2101279869, 902783233, 999, 999, 2750], //462
    ['Модернизированный прицел', 'weapon_heavysniper_mk2', -1135289737, 514930793, 999, 999, 250], //463
    ['Глушитель', 'weapon_heavysniper_mk2', -1404903567, 2042625932, 999, 999, 320], //464
    ['Дульный тормоз', 'weapon_heavysniper_mk2', 1602080333, 999, 999, 999, 390], //465
    ['Дульный тормоз с тупым наконечником', 'weapon_heavysniper_mk2', 1764221345, 999, 999, 999, 390], //466

    ['Фонарик', 'weapon_marksmanrifle', 2076495324, 2722601028, 999, 999, 70], //467
    ['Рукоятка', 'weapon_marksmanrifle', 202788691, 3745179589, 999, 999, 250], //468
    ['Глушитель', 'weapon_marksmanrifle', -2089531990, 2127522061, 999, 999, 320], //469
    ['Прицел', 'weapon_marksmanrifle', 471997210, 902783233, 999, 999, 440], //470

    ['Фонарик', 'weapon_grenadelauncher', 2076495324, 2722601028, 999, 999, 70], //471
    ['Рукоятка', 'weapon_grenadelauncher', 202788691, 3745179589, 999, 999, 250], //472
    ['Прицел', 'weapon_grenadelauncher', -1439939148, 3205897199, 999, 999, 440], //473

    ['Рецепт', '', 0, 1830344521, 50, 400, 5000], //474

    ['Ткань', '', 0, 667595401, 400, 1100, 10], //475
    ['Стальная пластина', '', 0, -1806890273, 4000, 6000, 100], //476
    ['Балончик с краской', '', 0, 1749718958, 700, 1500, 250], //477
    ['Плотная леска', '', 0, 1443647253, 300, 700, 1500], //478
    ['Улучшенный крючок', '', 0, 1373634352, 90, 150, 800], //479
    ['Приманка', '', 0, -1803909274, 300, 500, 111111], //480
    ['Палка', '', 0, 1167949327, 1200, 1800, 111111], //481
    ['Дрова', '', 0, 1167949327, 3100, 3600, 100], //482
    ['Костёр', '', 0, -1065766299, 6000, 8000, 111111], //483
    ['Зажигалка', '', 0, -680040094, 100, 400, 2], //484
    ['Гриль', '', 0, 977744387, 25000, 24000, 800], //485
    ['Палатка', '', 0, -1076837943, 19000, 21000, 1500], //486

    ['Американская евдошка', '', 0, -1803909274, 70, 150, 25], //487  Очень частая - 0
    ['Американская палия', '', 0, 910205311, 1200, 1500, 45], //488 Частая - 1
    ['Американский сомик', '', 0, 910205311, 650, 1800, 30], //489 Очень частая - 0
    ['Арктический голец', '', 0, 1108364521, 12000, 9500, 220], //490 Очень редкая - 4
    ['Белый осётр', '', 0, 1108364521, 16000, 10000, 500], //491 Невероятно редкая - 5
    ['Большеротый окунь', '', 0, 1108364521, 8000, 6250, 35], //492 Редкая - 3
    ['Гиодоны', '', 0, -1803909274, 110, 950, 35], //493 Очень частая - 0
    ['Ильная рыба', '', 0, 910205311, 4900, 3400, 65], //494 Немного редкая - 2
    ['Лопатоносы', '', 0, 1108364521, 8500, 7000, 115], //495 Редкая - 3
    ['Мальма', '', 0, 910205311, 500, 1300, 65], //496 Частая - 1
    ['Микижа', '', 0, 910205311, 1900, 1900, 75], //497 Частая - 1
    ['Обыкновенная гамбузия', '', 0, -1803909274, 15, 40, 15], //498 Очень частая - 0
    ['Пустынный карпозубик', '', 0, -1803909274, 20, 50, 15], //499 Очень частая - 0
    ['Тихоокеанская корюшка', '', 0, -1803909274, 15, 45, 20], //500 Очень частая - 0
    ['Чёрный сомик', '', 0, 910205311, 1250, 1150, 45], //501 Частая - 1
    ['Щука-маскинонг', '', 0, 1108364521, 17000, 10000, 515], //502 Невероятно редкая - 5
    ['Astyanax jordani', '', 0, -1803909274, 20, 60, 30], //503 Очень частая - 0
    ['Catostomus occidentalis', '', 0, 910205311, 850, 1600, 60], //504 Частая - 1
    ['Американский гидролаг', '', 0, 910205311, 2100, 1900, 75], //505 Частая - 1
    ['Американский стрелозубый палтус', '', 0, 910205311, 2800, 2300, 80], //506 Частая - 1
    ['Американский терпуг', '', 0, 910205311, 2100, 2100, 70], //507 Частая - 1
    ['Американский шэд', '', 0, 910205311, 5600, 4700, 90], //508 Немного редкая - 2
    ['Агономалы', '', 0, -1803909274, 120, 260, 30], //509 Очень частая - 0
    ['Алеутский морской окунь', '', 0, 1108364521, 5700, 6500, 135], //510 Редкая - 3
    ['Альбула', '', 0, 1108364521, 5300, 5500, 140], //511 Редкая - 3
    ['Бокаччо', '', 0, -1803909274, 340, 810, 35], //512 Очень частая - 0
    ['Гарибальдия', '', 0, -1803909274, 410, 940, 35], //513 Очень частая - 0
    ['Горбуша', '', 0, 910205311, 1700, 2100, 65], //514 Частая - 1
    ['Грунион', '', 0, -1803909274, 65, 180, 25], //515 Очень частая - 0
    ['Длиннопёрая ставрида', '', 0, 910205311, 2900, 3500, 80], //516 Немного редкая - 2
    ['Длиннопёрый тунец', '', 0, 1108364521, 17000, 10000, 500], //517 Невероятно редкая - 5
    ['Длиннохвостый тунец', '', 0, 1108364521, 14000, 9400, 255], //518 Очень редкая - 4
    ['Желтопёрый тунец', '', 0, 1108364521, 20000, 10000, 500], //519 Невероятно редкая - 5
    ['Запрора', '', 0, 910205311, 3200, 4200, 90], //520 Немного редкая - 2
    ['Звёздчатая камбала', '', 0, 1108364521, 7700, 7500, 155], //521 Редкая - 3
    ['Зеркальный солнечник', '', 0, 910205311, 2100, 2600, 75], //522 Немного редкая - 2
    ['Зимние камбалы', '', 0, 910205311, 1400, 1800, 65], //523 Частая - 1
    ['Зубастый терпуг', '', 0, 910205311, 4300, 3800, 85], //524 Немного редкая - 2
    ['Барракуда Сан-Андреаса', '', 0, 1108364521, 18000, 10000, 520], //525 Невероятно редкая - 5
    ['Бычья акула Сан-Андреаса', '', 0, 1108364521, 6200, 5500, 130], //526 Редкая - 3
    ['Кошачья акула-парматурус Сан-Андреаса', '', 0, 1108364521, 7700, 6000, 135], //527 Редкая - 3
    ['Макрель Сан-Андреаса', '', 0, 910205311, 3200, 4000, 85], //528 Немного редкая - 2
    ['Раздувающаяся акула Сан-Андреаса', '', 0, 1108364521, 20000, 10000, 510], //529 Невероятно редкая - 5
    ['Анчоус Сан-Андреаса', '', 0, -1803909274, 90, 260, 30], //530 Очень частая - 0
    ['Тифлогобиус Сан-Андреаса', '', 0, 1108364521, 18900, 10000, 550], //531 Невероятно редкая - 5
    ['Канареечный морской окунь', '', 0, 910205311, 2100, 2300, 75], //532 Частая - 1
    ['Кета', '', 0, 1108364521, 9200, 8000, 275], //533 Очень редкая - 4
    ['Кижуч', '', 0, 1108364521, 12000, 9000, 285], //534 Очень редкая - 4
    ['Колючий аротрон', '', 0, 910205311, 2700, 3200, 75], //535 Немного редкая - 2
    ['Коричневая кунья акула', '', 0, 1108364521, 14500, 9200, 290], //536 Очень редкая - 4
];

items.isWeapon = function(itemId) {
    return itemId >= 54 && itemId <= 138 || itemId == 146 || itemId == 147;
};

items.isComponent = function(itemId) {
    return itemId >= 293 && itemId <= 473;
};

items.isAmmo = function(itemId) {
    return itemId >= 279 && itemId <= 292;
};

items.getAmmoCount = function(itemId) {
    switch (itemId) {
        case 279:
        case 288:
        case 290:
            return 20;
        case 280:
            return 280;
        case 281:
            return 240;
        case 282:
            return 500;
        case 283:
        case 284:
            return 480;
        case 285:
        case 286:
        case 287:
            return 180;
        case 289:
        case 291:
        case 292:
            return 1;
    }
    return 10;
};

items.canEquipById = function(id)
{
    try
    {
        return items.itemList[id][2];
    }
    catch
    {
        return false;
    }
};

items.getItemNameById = function(id)
{
    try
    {
        return items.itemList[id][0];
    }
    catch
    {
        return "UNKNOWN";
    }
};

items.getItemNameHashById = function(id)
{
    try
    {
        return items.itemList[id][1];
    }
    catch
    {
        return "UNKNOWN";
    }
};

items.getItemHashModiferById = function(id)
{
    try
    {
        return items.itemList[id][2];
    }
    catch
    {
        return "UNKNOWN";
    }
};

items.getItemHashById = function(id)
{
    try
    {
        return items.itemList[id][3];
    }
    catch
    {
        return 1108364521;
    }
};

items.getItemWeightById = function(id)
{
    try
    {
        return items.itemList[id][4];
    }
    catch
    {
        return -1;
    }
};

items.getItemWeightKgById = function(id)
{
    try
    {
        return Math.Round(items.itemList[id][4] / 1000.0);
    }
    catch
    {
        return -1;
    }
};

items.getItemAmountById = function(id)
{
    try
    {
        return items.itemList[id][5];
    }
    catch
    {
        return -1;
    }
};

items.getItemPrice = function(id) {
    try
    {
        return items.itemList[id][6];
    }
    catch
    {
        return 0;
    }
};
